{
  "contact": {
    "email": "virajkaushalye1@gmail.com",
    "github": "github.com/dvsource",
    "linkedin": "linkedin/in/dvsource",
    "name": "Viraj Kaushalye",
    "phone": "+94 711 25 20 32",
    "website": "v4k8.dev"
  },
  "education": [
    {
      "degree": "Bachelor of Science in Applied Science",
      "focus": [
        "Computer Science",
        "Mathematics",
        "Statistics"
      ],
      "institution": "University of Sri Jayewardenepura",
      "period": "2015 - 2018"
    },
    {
      "focus": [
        "G.C.E A/L - Mathematics",
        "Physics",
        "Chemistry"
      ],
      "institution": "D. S. Senanayake College",
      "period": "2006 - 2014"
    }
  ],
  "experience": [
    {
      "company": "Matific - Sri Lanka",
      "roles": [
        {
          "description": "Built data-intensive activity pages, advanced filtering systems, reporting modules, and core admin tools using Angular and Django, optimizing performance for large datasets. (Matific - Teacher Site)\nDeveloped serverless microservices with AWS Lambda and a Rust PoC for high-performance computation, reducing operational costs.\nIncreased unit test coverage to 90%+, enhancing reliability and regression safety.\nWorked with global cross-functional teams (Mobile, Unity, Content, ML/AI, Support) to resolve production issues and improve integrations.\nContributed to company-wide UI component migration, improving consistency and maintainability.\nDelivered an Accessibility-compliant product version under tight deadlines for European and North American markets.\nBuilt a RAG-based AI agent using LangChain to assist backend support teams in troubleshooting customer issues without requiring developer intervention.",
          "period": "2022 - 2026",
          "title": "Senior Software Engineer"
        }
      ]
    },
    {
      "company": "Codegen International",
      "roles": [
        {
          "description": "Developed and maintained core functionality for the company’s B2B web platform, prioritizing performance, reliability, and usability.\nBuilt Angular-based WordPress widgets, migrated components to Web Elements, and deployed scalable Docker-Kubernetes infrastructure with NGINX.\nMentored junior developers, conducted productivity workshops, and hosted ongoing developer forums to enhance team learning.",
          "pageBreakAfter": true,
          "period": "2020 - 2022",
          "title": "Senior Software Engineer"
        },
        {
          "description": "Migrated Angular 7 applications to Angular 9; contributed to front-end modules for B2B travel functionalities (Supplier, Insurance, Generic).\nDeveloped internal project management tools integrating Jira and GitLab APIs; built reporting modules for management insights.\nImproved B2C travel platform (FlyDubai) booking flows and UI performance.",
          "pageBreakAfter": false,
          "period": "2019 - 2020",
          "title": "Software Engineer"
        },
        {
          "description": "Developed a full-stack Leave Management system for the enterprise social network (Kriyo.net).\nContributed to chatbot features, reporting modules, bug fixes, and overall application improvements.",
          "period": "2019",
          "title": "Trainee Software Engineer"
        }
      ]
    }
  ],
  "interests": [],
  "projects": [
    {
      "description": "An R&D project I developed at Matific. It is an AI-powered assistant designed to help support staff understand the logic behind product functionalities without needing to consult developers, especially when handling new or complex customer issues.\n\nBuilt using LangChain, a vector database, text embeddings, and OpenAI LLMs.",
      "name": "RAG-based Knowledge-based Assistant"
    },
    {
      "description": "A project I built for my wife. It is a collection of tools designed to support her day-to-day work at school and private classes.\n\nThe system includes AI-powered features to assist with her teaching career, such as generating new Physics problem ideas, simplifying complex concepts, and helping create structured lesson plans and schedules.",
      "name": "A/L Physics Teacher Assistant + Class Scheduler"
    },
    {
      "description": "My personal website and portfolio combined with a comprehensive life management toolkit.\n\nIt includes tools for task management, time management, habit tracking, finance and expense tracking, and TBR tracking. The system also features a CLI tool that allows me to insert and retrieve data directly from the terminal without interrupting my workflow.",
      "name": "Personal Life Management System"
    },
    {
      "description": "Final-year university project — an augmented reality application built with Unity and iOS ARKit.\n\nThe application was designed to help visitors navigate large buildings by providing real-time, AR-based indoor guidance and directional assistance.",
      "name": "AR-based Indoor Navigation Guide"
    }
  ],
  "skills": [
    {
      "items": "Java, JavaScript/TypeScript, C#, Python, PHP, Go, Rust",
      "label": "Languages"
    },
    {
      "items": "Angular, React, Tailwind, SCSS",
      "label": "Frontend"
    },
    {
      "items": "Spring Boot, Node.js, Django, Flask",
      "label": "Backend"
    },
    {
      "items": "Next js",
      "label": "Fullstack"
    },
    {
      "items": "Docker, Kubernetes, AWS, Jenkins",
      "label": "CI/CD & Cloud"
    },
    {
      "items": "MySQL, PostgreSQL, MongoDB, Redis, Elasticsearch",
      "label": "Databases"
    },
    {
      "items": "Unity, Tauri, Electron, React Native, Bash, Linux",
      "label": "Other"
    }
  ],
  "summary": "Software developer focused on building clean, maintainable, and scalable systems across the full stack. Strong interest in distributed systems, system architecture, and designing reliable software across frontend and backend systems. Passionate about exploring open-source projects to understand engineering patterns and architectural trade-offs.\nCommitted to efficiency, reliability, and automation, with a strong focus on improving developer productivity and long-term maintainability. Hands-on experience with modern AI technologies, including agent-based systems and MCP/RAG implementations, applying them to rapidly evolving development workflows."
}
